
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ПересчитатьСуммуТекущейСтрокиТовары();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ПересчитатьСуммуТекущейСтрокиТовары();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пересчитывает сумму для текущей строки ТЧ Товары
//
&НаКлиенте
Процедура ПересчитатьСуммуТекущейСтрокиТовары()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
КонецПроцедуры

#КонецОбласти
